[Killed] ArrowFunction
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:7:31
 import { useBackendMutation } from "main/utils/useBackend";
 import ConvertedSectionTable from "main/components/Common/ConvertedSectionTable";
 
-export const classroomOrAll = (query) =>
-  query.classroom || "ALL";
+export const classroomOrAll = () => undefined;
 
 export default function CourseOverTimeBuildingsIndexPage() {
killedBy: CourseOverTimeBuildingsIndexPage tests handles sections without timeLocations when filtering
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:8:3
 import ConvertedSectionTable from "main/components/Common/ConvertedSectionTable";
 
 export const classroomOrAll = (query) =>
-  query.classroom || "ALL";
+  true;
 
 export default function CourseOverTimeBuildingsIndexPage() {
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:8:3
 import ConvertedSectionTable from "main/components/Common/ConvertedSectionTable";
 
 export const classroomOrAll = (query) =>
-  query.classroom || "ALL";
+  false;
 
 export default function CourseOverTimeBuildingsIndexPage() {
killedBy: CourseOverTimeBuildingsIndexPage tests handles sections without timeLocations when filtering
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] BlockStatement
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:35:57
     [],
   );
 
-  async function fetchCourseOverTimeJSON(_event, query) {
-    setSelectedClassroom(classroomOrAll(query));
-    mutation.mutate(query);
-  }
+  async function fetchCourseOverTimeJSON(_event, query) {}
 
   const filteredSections =
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: expected 0 to be greater than or equal to 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:41:5
   }
 
   const filteredSections =
-    !selectedClassroom || selectedClassroom === "ALL"
+    true
       ? courseJSON
       : courseJSON.filter(
killedBy: CourseOverTimeBuildingsIndexPage tests handles sections without timeLocations when filtering
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:45:13
       ? courseJSON
       : courseJSON.filter(
           (cs) =>
-            cs.section &&
-            cs.section.timeLocations &&
-            cs.section.timeLocations.some(
-              (loc) => loc.room === selectedClassroom,
-            ),
+            false,
         );
 
killedBy: CourseOverTimeBuildingsIndexPage tests filters sections by classroom when classroom is selected
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
