[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:41:38
   };
 
   useEffect(() => {
-    async function fetchClassrooms() {
-      if (Quarter && buildingCode) {
-        try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
-          const response = await axios.get(
-            "/api/public/courseovertime/buildingsearch/classrooms",
-            {
-              params: { quarter: Quarter, buildingCode },
-            },
-          );
-          console.log("Classrooms returned:", response.data);
-          const classrooms = response.data.sort();
-
-          setAvailableClassrooms(classrooms);
-
-          setClassroom("ALL");
-        } catch (error) {
-          console.error("Error fetching classrooms", error);
-          setAvailableClassrooms([]);
-        }
-      }
-    }
+    async function fetchClassrooms() {}
     fetchClassrooms();
   }, [Quarter, buildingCode]);
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: expected [] to deeply equal [ '1004', '1106', '1108', …(17) ]
