[Killed] ConditionalExpression
main/pages/CourseOverTime/CourseOverTimeBuildingsIndexPage.jsx:42:27
   }
 
   const filteredSections =
-    !selectedClassroom || selectedClassroom === "ALL"
+    !selectedClassroom || false
       ? courseJSON
       : courseJSON.filter(
killedBy: CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find an element with the text: (text)=>text.includes("184"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
