[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:40:19
     fetchJSON(event, { Quarter, buildingCode, classroom });
   };
 
-  useEffect(() => {
-    async function fetchClassrooms() {
-      if (Quarter && buildingCode) {
-        try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
-          const response = await axios.get(
-            "/api/public/courseovertime/buildingsearch/classrooms",
-            {
-              params: { quarter: Quarter, buildingCode },
-            },
-          );
-          console.log("Classrooms returned:", response.data);
-          const classrooms = response.data.sort();
-
-          setAvailableClassrooms(classrooms);
-
-          setClassroom("ALL");
-        } catch (error) {
-          console.error("Error fetching classrooms", error);
-          setAvailableClassrooms([]);
-        }
-      }
-    }
-    fetchClassrooms();
-  }, [Quarter, buildingCode]);
+  useEffect(() => {}, [Quarter, buildingCode]);
 
   return (
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: expected [] to deeply equal [ '1004', '1106', '1108', …(17) ]

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:43:13
   useEffect(() => {
     async function fetchClassrooms() {
       if (Quarter && buildingCode) {
-        try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
-          const response = await axios.get(
-            "/api/public/courseovertime/buildingsearch/classrooms",
-            {
-              params: { quarter: Quarter, buildingCode },
-            },
-          );
-          console.log("Classrooms returned:", response.data);
-          const classrooms = response.data.sort();
-
-          setAvailableClassrooms(classrooms);
-
-          setClassroom("ALL");
-        } catch (error) {
+        try {} catch (error) {
           console.error("Error fetching classrooms", error);
           setAvailableClassrooms([]);
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: expected [] to deeply equal [ '1004', '1106', '1108', …(17) ]

[Survived] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:56:24
 
           setAvailableClassrooms(classrooms);
 
-          setClassroom("ALL");
+          setClassroom("");
         } catch (error) {
           console.error("Error fetching classrooms", error);

[Killed] EqualityOperator
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:97:27
               <Form.Select
                 value={classroom}
                 onChange={(e) => setClassroom(e.target.value)}
-                disabled={availableClassrooms.length === 0}
+                disabled={availableClassrooms.length !== 0}
                 data-testid="CourseOverTimeBuildingsSearch.ClassroomSelect"
               >
killedBy: CourseOverTimeBuildingsSearchForm tests renders nothing when classrooms is empty
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <select
  class="form-select"
  data-testid="CourseOverTimeBuildingsSearch.ClassroomSelect"
  id="CourseOverTimeBuildingsSearch.Classroom"
/>
