[Killed] BlockStatement
src/main/utils/systemInfo.jsx:4:33
 import { useQuery } from "react-query";
 import axios from "axios";
 
-export function useSystemInfo() {
-  return useQuery(
-    "systemInfo",
-    async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {};
-      }
-    },
-    {
-      initialData: {
-        initialData: true,
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-        startQtrYYYYQ: "20221",
-        endQtrYYYYQ: "20222",
-      },
-    },
-  );
-}
+export function useSystemInfo() {}
 
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: Cannot destructure property 'data' of '(0 , __vite_ssr_import_5__.useSystemInfo)(...)' as it is undefined.
