[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:127:26
     {
       accessorKey: "courseId",
       header: "Course ID",
-      cell: ({ row }) => {
-        return renderDetailPageLink(row, testid);
-        
-      },
+      cell: ({ row }) => {},
     },
     {
killedBy: SectionsTable tests Section Table tests Has the expected column headers and content; SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response; SectionSearchesIndexPageNotLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  MATH 2A
Received:
