[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:119:37
   </p>
 );
 
-export const renderDetailPageLink = (row, testid) => (
-  
-  <p align="center">
-    <a
-      href={formatInfoLink(row)}
-      data-testid={`${testid}-row-${row.id}-col-detail-link`}
-      target={"_blank"}
-      rel="noopener noreferrer"
-    >
-    {row.original.courseId}
-    </a>
-  </p>
-);
+export const renderDetailPageLink = () => undefined;
 
 export function enrollmentFraction(row) {
killedBy: section utils tests renderDetailPageLink tests renderDetailPageLink test
statusReason: Cannot read properties of undefined (reading 'props')

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:134:36
 );
 
 export function enrollmentFraction(row) {
-  const num = getSectionField(row, "enrolledTotal");
+  const num = getSectionField(row, "");
   const denom = getSectionField(row, "maxEnroll");
   const result = convertToFraction(num, denom);
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  172/175
Received:
