[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:49:35
   }
 };
 
-export const onError = (error) => {
-  console.error("onError: error=", error);
-  const message =
-    error.response.data?.message ||
-    `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
-  toast.error(message);
-};
+export const onError = (error) => {};
 
 /* eslint-enable react-refresh/only-export-components*/
killedBy: SectionsTable tests onError should display an error message with the response data
statusReason: expected "vi.fn()" to be called with arguments: [ 'An error occurred' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:145:11
       cell: ({ row }) => enrollmentFraction(row),
     },
     {
-      id: "location",
+      id: "",
       header: "Location",
       cell: ({ row }) => formatLocation(getSection(row).timeLocations),
killedBy: SectionsTable tests onError should display an error message with the response data
statusReason: Columns require an id when using a non-string header
