[Killed] ArithmeticOperator
main/components/GradeHistory/GradeHistoryGraph.jsx:68:24
     grade,
     count: gradeCounts[grade] || 0,
     percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
+      totalCount > 0 ? (gradeCounts[grade] || 0) / totalCount / 100 : 0,
   }));
 };
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
