[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryGraph.jsx:43:37
 // Stryker restore all
 
 // from an input YYYYQ, create a prettier formatted output
-const yyyyqToPrettyStr = (yyyyq) => {
-  const [year, qtr] = [yyyyq.slice(0, 4), yyyyq[4]];
-  return `${qtrNumToQuarter[qtr]} ${year}`;
-};
+const yyyyqToPrettyStr = (yyyyq) => {};
 
 const formatTooltip = (value, _, props) => {
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information; GradeHistoryGraph UI tests renders a single graph for one quarter of data
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[NoCoverage] BlockStatement
main/components/GradeHistory/GradeHistoryGraph.jsx:48:44
   return `${qtrNumToQuarter[qtr]} ${year}`;
 };
 
-const formatTooltip = (value, _, props) => {
-  return [`Percentage: ${value.toFixed(1)}%, Count: ${props.payload.count}`];
-};
+const formatTooltip = (value, _, props) => {};
 
 // Helper function to fill in for when 0 students got a grade

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryGraph.jsx:54:50
 
 // Helper function to fill in for when 0 students got a grade
 const createCompleteGradeData = (data) => {
-  const gradeCounts = data.reduce((acc, item) => {
-    acc[item.grade] = item.count;
-    return acc;
-  }, {});
+  const gradeCounts = data.reduce((acc, item) => {}, {});
 
   const totalCount = Object.values(gradeCounts).reduce(
killedBy: GradeHistoryGraph UI tests renders a single graph for one quarter of data
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryGraph.jsx:66:12
 
   return allGrades.map((grade) => ({
     grade,
-    count: gradeCounts[grade] || 0,
+    count: false,
     percentage:
       totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryGraph.jsx:73:51
 };
 
 // Helper function to group data by `yyyyq` and `instructor`
-const groupDataByQuarterAndInstructor = (data) => {
-  const groupedData = {};
-
-  // Added sort function to be able to display data by most recent quarter
-  data.sort((a, b) => {
-    const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
-    const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
-
-    if (yearA !== yearB) {
-      return yearB - yearA;
-    } else {
-      return qtrB - qtrA;
-    }
-  });
-
-  data.forEach((item) => {
-    const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) {
-      groupedData[key] = [];
-    }
-    groupedData[key].push(item);
-  });
-
-  return groupedData;
-};
+const groupDataByQuarterAndInstructor = (data) => {};
 
 // Component to render a single bar chart for a specific group of data
killedBy: GradeHistoryGraph UI tests renders without crashing for empty graph
statusReason: Cannot convert undefined or null to object

[Killed] MethodExpression
main/components/GradeHistory/GradeHistoryGraph.jsx:77:3
   const groupedData = {};
 
   // Added sort function to be able to display data by most recent quarter
-  data.sort((a, b) => {
-    const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
-    const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
-
-    if (yearA !== yearB) {
-      return yearB - yearA;
-    } else {
-      return qtrB - qtrA;
-    }
-  });
+  data;
 
   data.forEach((item) => {
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryGraph.jsx:81:9
     const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 
-    if (yearA !== yearB) {
+    if (true) {
       return yearB - yearA;
     } else {
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryGraph.jsx:83:12
 
     if (yearA !== yearB) {
       return yearB - yearA;
-    } else {
-      return qtrB - qtrA;
-    }
+    } else {}
   });
 
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/components/GradeHistory/GradeHistoryGraph.jsx:90:9
 
   data.forEach((item) => {
     const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) {
+    if (groupedData[key]) {
       groupedData[key] = [];
     }
killedBy: GradeHistoryGraph UI tests renders a single graph for one quarter of data
statusReason: Cannot read properties of undefined (reading 'push')
