[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.jsx:74:12
               <h2>Sections in Personal Schedule</h2>
             </Col>
           </Row>
-          {personalSection && (
-            <PersonalSectionsTable
-              personalSections={personalSection}
-              psId={id}
-              currentUser={currentUser}
-            />
-          )}
+          {personalSection || <PersonalSectionsTable personalSections={personalSection} psId={id} currentUser={currentUser} />}
           {personalSection && (
             <>
killedBy: PersonalSchedulesDetailsPage tests renders without crashing for regular user
statusReason: Cannot read properties of undefined (reading 'length')
