[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryGraph.jsx:29:37
 // Stryker restore all
 
 //from an input YYYYQ, create a prettier formated output that I like
-const yyyyqToPrettyStr = (yyyyq) => {
-  const [year, qtr] = [yyyyq.slice(0, 4), yyyyq[4]];
-  return `${qtrNumToQuarter[qtr]} ${year}`;
-};
+const yyyyqToPrettyStr = (yyyyq) => {};
 
 // Component to render a single bar chart for a specific group of data
killedBy: Grade history tests Has the expected values for one graph
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="grade-history-graphs"
    >

[Killed] MethodExpression
main/components/GradeHistory/GradeHistoryGraph.jsx:30:24
 
 //from an input YYYYQ, create a prettier formated output that I like
 const yyyyqToPrettyStr = (yyyyq) => {
-  const [year, qtr] = [yyyyq.slice(0, 4), yyyyq[4]];
+  const [year, qtr] = [yyyyq, yyyyq[4]];
   return `${qtrNumToQuarter[qtr]} ${year}`;
 };
killedBy: Grade history tests Has the expected values for one graph
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="grade-history-graphs"
    >

[Killed] ArrayDeclaration
main/components/GradeHistory/GradeHistoryGraph.jsx:30:23
 
 //from an input YYYYQ, create a prettier formated output that I like
 const yyyyqToPrettyStr = (yyyyq) => {
-  const [year, qtr] = [yyyyq.slice(0, 4), yyyyq[4]];
+  const [year, qtr] = [];
   return `${qtrNumToQuarter[qtr]} ${year}`;
 };
killedBy: Grade history tests Has the expected values for one graph
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="grade-history-graphs"
    >
