[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.jsx:47:28
   );
   // Stryker restore all
 
-  const backButton = () => {
-    return (
-      <Button
-        variant="primary"
-        onClick={() => navigate("/personalschedules/list")}
-      >
-        Back
-      </Button>
-    );
-  };
+  const backButton = () => {};
 
   return (
killedBy: PersonalSchedulesDetailsPage tests renders without crashing for regular user
statusReason: Unable to find an accessible element with the role "button" and name `/back/i`

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.jsx:51:18
     return (
       <Button
         variant="primary"
-        onClick={() => navigate("/personalschedules/list")}
+        onClick={() => undefined}
       >
         Back
killedBy: PersonalSchedulesDetailsPage tests navigates to list page when 'Back' button is clicked
statusReason: expected "vi.fn()" to be called with arguments: [ '/personalschedules/list' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.jsx:74:12
               <h2>Sections in Personal Schedule</h2>
             </Col>
           </Row>
-          {personalSection && (
-            <PersonalSectionsTable
-              personalSections={personalSection}
-              psId={id}
-              currentUser={currentUser}
-            />
-          )}
+          {true}
           {personalSection && (
             <>
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Unable to find an element by: [data-testid="PersonalSectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.jsx:81:12
               currentUser={currentUser}
             />
           )}
-          {personalSection && (
-            <>
-              <h2 className="mt-4">Weekly Schedule</h2>
-              <PersonalSchedulePanel
-                Events={transformToEvents(personalSection)}
-              />
-            </>
-          )}
+          {false}
         </div>
         {backButton()}
killedBy: PersonalSchedulesDetailsPage tests renders 'Back' button and 'Weekly Schedule' section
statusReason: Unable to find an element with the text: Weekly Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.jsx:81:12
               currentUser={currentUser}
             />
           )}
-          {personalSection && (
-            <>
-              <h2 className="mt-4">Weekly Schedule</h2>
-              <PersonalSchedulePanel
-                Events={transformToEvents(personalSection)}
-              />
-            </>
-          )}
+          {true}
         </div>
         {backButton()}
killedBy: PersonalSchedulesDetailsPage tests renders 'Back' button and 'Weekly Schedule' section
statusReason: Unable to find an element with the text: Weekly Schedule. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
