[Killed] ArrayDeclaration
main/components/GradeHistory/GradeHistoryHelper.jsx:1:19
-const allGrades = [
-  "A+",
-  "A",
-  "A-",
-  "B+",
-  "B",
-  "B-",
-  "C+",
-  "C",
-  "C-",
-  "D+",
-  "D",
-  "D-",
-  "F",
-  "P",
-  "W",
-  "NP",
-];
+const allGrades = [];
 
 export const formatTooltip = (value, _, props) => {
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [] to deeply equal [ …(16) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:5:3
   "A+",
   "A",
   "A-",
-  "B+",
+  "",
   "B",
   "B-",
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:10:3
   "B-",
   "C+",
   "C",
-  "C-",
+  "",
   "D+",
   "D",
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:12:3
   "C",
   "C-",
   "D+",
-  "D",
+  "",
   "D-",
   "F",
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:14:3
   "D+",
   "D",
   "D-",
-  "F",
+  "",
   "P",
   "W",
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:17:3
   "F",
   "P",
   "W",
-  "NP",
+  "",
 ];
 
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryHelper.jsx:20:51
   "NP",
 ];
 
-export const formatTooltip = (value, _, props) => {
-  return [`Percentage: ${value.toFixed(1)}%, Count: ${props.payload.count}`];
-};
+export const formatTooltip = (value, _, props) => {};
 
 // Helper function to fill in for when 0 students got a grade
killedBy: formatTooltip tooltip displays correct formatted text
statusReason: expected undefined to deeply equal [ 'Percentage: 50.1%, Count: 10' ]

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryHelper.jsx:25:50
 };
 
 // Helper function to fill in for when 0 students got a grade
-export const createCompleteGradeData = (data) => {
-  const gradeCounts = data.reduce((acc, item) => {
-    acc[item.grade] = item.count;
-    return acc;
-  }, {});
-
-  const totalCount = Object.values(gradeCounts).reduce(
-    (acc, count) => acc + count,
-    0,
-  );
-
-  return allGrades.map((grade) => ({
-    grade,
-    count: gradeCounts[grade] || 0,
-    percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
-  }));
-};
+export const createCompleteGradeData = (data) => {};
 
 // Helper function to group data by `yyyyq` and `instructor`
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected undefined to deeply equal [ …(16) ]

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryHelper.jsx:26:50
 
 // Helper function to fill in for when 0 students got a grade
 export const createCompleteGradeData = (data) => {
-  const gradeCounts = data.reduce((acc, item) => {
-    acc[item.grade] = item.count;
-    return acc;
-  }, {});
+  const gradeCounts = data.reduce((acc, item) => {}, {});
 
   const totalCount = Object.values(gradeCounts).reduce(
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: Cannot convert undefined or null to object

[Killed] ArithmeticOperator
main/components/GradeHistory/GradeHistoryHelper.jsx:32:21
   }, {});
 
   const totalCount = Object.values(gradeCounts).reduce(
-    (acc, count) => acc + count,
+    (acc, count) => acc - count,
     0,
   );
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] ObjectLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:36:36
     0,
   );
 
-  return allGrades.map((grade) => ({
-    grade,
-    count: gradeCounts[grade] || 0,
-    percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
-  }));
+  return allGrades.map((grade) => ({}));
 };
 
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ Array(16) ] to deeply equal [ …(16) ]

[Killed] EqualityOperator
main/components/GradeHistory/GradeHistoryHelper.jsx:40:7
     grade,
     count: gradeCounts[grade] || 0,
     percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
+      totalCount >= 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
   }));
 };
killedBy: createCompleteGradeData returns zero percentage when total count is zero
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryHelper.jsx:46:58
 
 // Helper function to group data by `yyyyq` and `instructor`
 // This will allow different instructors in the same quarter to be displayed seperatly
-export const groupDataByQuarterAndInstructor = (data) => {
-  const groupedData = {};
-
-  // Added sort function to be able to display data by most recent quarter
-  data.sort((a, b) => {
-    const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
-    const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
-
-    if (yearA !== yearB) {
-      return yearB - yearA;
-    } else {
-      return qtrB - qtrA;
-    }
-  });
-
-  data.forEach((item) => {
-    const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) {
-      groupedData[key] = [];
-    }
-    groupedData[key].push(item);
-  });
-
-  return groupedData;
-};
+export const groupDataByQuarterAndInstructor = (data) => {};
 
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryHelper.jsx:50:23
   const groupedData = {};
 
   // Added sort function to be able to display data by most recent quarter
-  data.sort((a, b) => {
-    const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
-    const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
-
-    if (yearA !== yearB) {
-      return yearB - yearA;
-    } else {
-      return qtrB - qtrA;
-    }
-  });
+  data.sort((a, b) => {});
 
   data.forEach((item) => {
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: expected [ '20094-GONZALEZ T F', …(41) ] to deeply equal [ '20222-LOKSHTANOV D', …(41) ]

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:54:9
     const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 
-    if (yearA !== yearB) {
+    if (false) {
       return yearB - yearA;
     } else {
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: expected [ '20094-GONZALEZ T F', …(41) ] to deeply equal [ '20222-LOKSHTANOV D', …(41) ]

[Killed] ArithmeticOperator
main/components/GradeHistory/GradeHistoryHelper.jsx:55:14
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 
     if (yearA !== yearB) {
-      return yearB - yearA;
+      return yearB + yearA;
     } else {
       return qtrB - qtrA;
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: expected [ '20094-GONZALEZ T F', …(41) ] to deeply equal [ '20222-LOKSHTANOV D', …(41) ]

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryHelper.jsx:61:26
     }
   });
 
-  data.forEach((item) => {
-    const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) {
-      groupedData[key] = [];
-    }
-    groupedData[key].push(item);
-  });
+  data.forEach((item) => {});
 
   return groupedData;
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: expected [] to deeply equal [ '20222-LOKSHTANOV D', …(41) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:62:17
   });
 
   data.forEach((item) => {
-    const key = `${item.yyyyq}-${item.instructor}`;
+    const key = ``;
     if (!groupedData[key]) {
       groupedData[key] = [];
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: expected [ '' ] to deeply equal [ '20222-LOKSHTANOV D', …(41) ]

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryHelper.jsx:63:28
 
   data.forEach((item) => {
     const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) {
-      groupedData[key] = [];
-    }
+    if (!groupedData[key]) {}
     groupedData[key].push(item);
   });
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:63:9
 
   data.forEach((item) => {
     const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) {
+    if (true) {
       groupedData[key] = [];
     }
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information; Grade history tests Correctly outputs data for one quarter
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
