[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:21:20
 const CourseOverTimeSearchForm = ({ fetchJSON }) => {
   const { data: systemInfo } = useSystemInfo();
 
-  const startQtr = systemInfo?.startQtrYYYYQ || "20211";
+  const startQtr = true;
   const endQtr = systemInfo?.endQtrYYYYQ || "20214";
 
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: param should be a string

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:21:20
 const CourseOverTimeSearchForm = ({ fetchJSON }) => {
   const { data: systemInfo } = useSystemInfo();
 
-  const startQtr = systemInfo?.startQtrYYYYQ || "20211";
+  const startQtr = systemInfo?.startQtrYYYYQ && "20211";
   const endQtr = systemInfo?.endQtrYYYYQ || "20214";
 
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^Searching for: ANTH for quarters W22 through W22$/
Received:
  Searching for: ANTH for quarters W21 through W21

[Killed] OptionalChaining
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:22:18
   const { data: systemInfo } = useSystemInfo();
 
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20214";
+  const endQtr = systemInfo.endQtrYYYYQ || "20214";
 
   const quarters = quarterRange(startQtr, endQtr);
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm with null system info when system info is null, fallback values are used
statusReason: Unable to find an element by: [data-testid="CourseOverTimeSearch.StartQuarter-option-0"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:40:5
     status: _status,
   } = useBackend(
     ["/api/UCSBSubjects/all"],
-    {
-      // Stryker disable next-line StringLiteral : GET is the default, so replacing with empty string is an equivalent mutation
-      method: "GET",
-      url: "/api/UCSBSubjects/all",
-    },
+    {},
     [],
   );
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response; CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly with mocked localStorage values
statusReason: Unable to find an element by: [data-testid="CourseOverTimeSearch.Subject-option-ANTH"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrayDeclaration
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:45:5
       method: "GET",
       url: "/api/UCSBSubjects/all",
     },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:51:5
   const defaultSubjectArea = "ANTH";
 
   const [startQuarter, setStartQuarter] = useState(
-    localStartQuarter || quarters[0].yyyyq,
+    localStartQuarter && quarters[0].yyyyq,
   );
   const [endQuarter, setEndQuarter] = useState(
killedBy: CourseOverTimeIndexPage tests renders without crashing; CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: Cannot read properties of null (reading 'charAt')

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:51:5
   const defaultSubjectArea = "ANTH";
 
   const [startQuarter, setStartQuarter] = useState(
-    localStartQuarter || quarters[0].yyyyq,
+    false,
   );
   const [endQuarter, setEndQuarter] = useState(
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: yyyyq.charAt is not a function

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:54:5
     localStartQuarter || quarters[0].yyyyq,
   );
   const [endQuarter, setEndQuarter] = useState(
-    localEndQuarter || quarters[0].yyyyq,
+    false,
   );
   const [subject, setSubject] = useState(
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: yyyyq.charAt is not a function

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:54:5
     localStartQuarter || quarters[0].yyyyq,
   );
   const [endQuarter, setEndQuarter] = useState(
-    localEndQuarter || quarters[0].yyyyq,
+    localEndQuarter && quarters[0].yyyyq,
   );
   const [subject, setSubject] = useState(
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: Cannot read properties of null (reading 'charAt')

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:57:5
     localEndQuarter || quarters[0].yyyyq,
   );
   const [subject, setSubject] = useState(
-    localSubject || subjects[0]?.subjectCode || defaultSubjectArea,
+    false,
   );
   const [courseNumber, setCourseNumber] = useState("");
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^ANTH$/
Received:
  false

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:57:5
     localEndQuarter || quarters[0].yyyyq,
   );
   const [subject, setSubject] = useState(
-    localSubject || subjects[0]?.subjectCode || defaultSubjectArea,
+    false || defaultSubjectArea,
   );
   const [courseNumber, setCourseNumber] = useState("");
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly with mocked localStorage values
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^CMPSC$/
Received:
  ANTH

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:59:52
   const [subject, setSubject] = useState(
     localSubject || subjects[0]?.subjectCode || defaultSubjectArea,
   );
-  const [courseNumber, setCourseNumber] = useState("");
+  const [courseNumber, setCourseNumber] = useState("Stryker was here!");
   const [courseSuf, setCourseSuf] = useState("");
 
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^ANTH$/
Received:
  ANTH Stryker was here!

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:63:22
   const [courseSuf, setCourseSuf] = useState("");
 
   const submitAction = (event) => {
-    fetchJSON(event, {
-      startQuarter,
-      endQuarter,
-      subject,
-      courseNumber,
-      courseSuf,
-    });
+    fetchJSON(event, {});
   };
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response; CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests when I click submit, the right stuff happens
statusReason: expected { startQtr: undefined, …(3) } to deeply equal { startQtr: '20222', …(3) }

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:123:66
               <Form.Label>Course Number</Form.Label>
               <Form.Control
                 isInvalid={Boolean(errors.CourseOverTimeSearchCourseNumber)}
-                {...register("CourseOverTimeSearchCourseNumber", {
-                  pattern: courseNumRegex,
-                  onChange: (e) => handleCourseNumberOnChange(e), // Here's the fix!
-                })}
+                {...register("CourseOverTimeSearchCourseNumber", {})}
               />
               <Form.Text muted>
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests when I select a course number without suffix, the state for course number changes; CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^ANTH 24$/
Received:
  ANTH

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:123:30
               <Form.Label>Course Number</Form.Label>
               <Form.Control
                 isInvalid={Boolean(errors.CourseOverTimeSearchCourseNumber)}
-                {...register("CourseOverTimeSearchCourseNumber", {
+                {...register("", {
                   pattern: courseNumRegex,
                   onChange: (e) => handleCourseNumberOnChange(e), // Here's the fix!
killedBy: CourseOverTimeIndexPage tests renders without crashing; CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ArrowFunction
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:125:29
                 isInvalid={Boolean(errors.CourseOverTimeSearchCourseNumber)}
                 {...register("CourseOverTimeSearchCourseNumber", {
                   pattern: courseNumRegex,
-                  onChange: (e) => handleCourseNumberOnChange(e), // Here's the fix!
+                  onChange: () => undefined, // Here's the fix!
                 })}
               />
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests when I select a course number without suffix, the state for course number changes; CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^ANTH 24$/
Received:
  ANTH

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:132:18
                 {"For example: '16' or '130A'; omit the subject area prefix."}
               </Form.Text>
               <Form.Control.Feedback type="invalid">
-                {errors.CourseOverTimeSearchCourseNumber &&
-                  "Course Number is required. "}
+                {true}
                 {errors.CourseOverTimeSearchCourseNumber?.type === "pattern" &&
                   "Course number should be a 1 to 3 digit number, optionally followed by up to two letters."}
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm test for form validations on CourseNumber validates course number format
statusReason: Unable to find an element with the text: /Course Number is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="CourseOverTimeSearchForm"

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:132:18
                 {"For example: '16' or '130A'; omit the subject area prefix."}
               </Form.Text>
               <Form.Control.Feedback type="invalid">
-                {errors.CourseOverTimeSearchCourseNumber &&
-                  "Course Number is required. "}
+                {false}
                 {errors.CourseOverTimeSearchCourseNumber?.type === "pattern" &&
                   "Course number should be a 1 to 3 digit number, optionally followed by up to two letters."}
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm test for form validations on CourseNumber validates course number format
statusReason: Unable to find an element with the text: /Course Number is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="CourseOverTimeSearchForm"

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:134:18
               <Form.Control.Feedback type="invalid">
                 {errors.CourseOverTimeSearchCourseNumber &&
                   "Course Number is required. "}
-                {errors.CourseOverTimeSearchCourseNumber?.type === "pattern" &&
-                  "Course number should be a 1 to 3 digit number, optionally followed by up to two letters."}
+                {true}
               </Form.Control.Feedback>
             </Form.Group>
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm test for form validations on CourseNumber validates course number format
statusReason: Unable to find an element with the text: /Course number should be a 1 to 3 digit number, optionally followed by up to two letters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="Cou

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:134:18
               <Form.Control.Feedback type="invalid">
                 {errors.CourseOverTimeSearchCourseNumber &&
                   "Course Number is required. "}
-                {errors.CourseOverTimeSearchCourseNumber?.type === "pattern" &&
+                {true &&
                   "Course number should be a 1 to 3 digit number, optionally followed by up to two letters."}
               </Form.Control.Feedback>
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests when I click submit, the right stuff happens
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Course number should be a 1 to 3 digit number, optionally followed by up to two letters.
</div> instead
