[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:5:48
 import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
 import { faInfoCircle } from "@fortawesome/free-solid-svg-icons";
 
-export const convertToFraction = (en1, en2) => {
-  return en1 != null && en2 != null ? `${en1}/${en2}` : "";
-};
+export const convertToFraction = (en1, en2) => {};
 
 // Takes a time location array and returns the locations
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users; SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  84/100
Received:

[Killed] LogicalOperator
src/main/utils/sectionUtils.jsx:6:10
 import { faInfoCircle } from "@fortawesome/free-solid-svg-icons";
 
 export const convertToFraction = (en1, en2) => {
-  return en1 != null && en2 != null ? `${en1}/${en2}` : "";
+  return en1 != null || en2 != null ? `${en1}/${en2}` : "";
 };
 
killedBy: section utils tests convertToFraction tests convertToFraction one null test 1
statusReason: expected 'null/100' to be '' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:6:10
 import { faInfoCircle } from "@fortawesome/free-solid-svg-icons";
 
 export const convertToFraction = (en1, en2) => {
-  return en1 != null && en2 != null ? `${en1}/${en2}` : "";
+  return false ? `${en1}/${en2}` : "";
 };
 
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  172/175
Received:

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:10:54
 };
 
 // Takes a time location array and returns the locations
-export const formatLocation = (timeLocationArray) => {
-  try {
-    let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
-      res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
-      if (index + 1 < timeLocationArray.length) {
-        res += `, `;
-      }
-    }
-    return res;
-  } catch {
-    return "";
-  }
-};
+export const formatLocation = (timeLocationArray) => {};
 
 // Takes a time location array and returns the days
killedBy: section utils tests formatLocation tests formatLocation test
statusReason: expected undefined to be 'LOC1 1, LOC2 2' // Object.is equality

[Killed] UpdateOperator
src/main/utils/sectionUtils.jsx:13:59
 export const formatLocation = (timeLocationArray) => {
   try {
     let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
+    for (let index = 0; index < timeLocationArray.length; index--) {
       res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
       if (index + 1 < timeLocationArray.length) {
killedBy: section utils tests formatLocation tests formatLocation test
statusReason: expected '' to be 'LOC1 1, LOC2 2' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:13:25
 export const formatLocation = (timeLocationArray) => {
   try {
     let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
+    for (let index = 0; false; index++) {
       res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
       if (index + 1 < timeLocationArray.length) {
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  BUCHN 1930
Received:

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:15:11
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
       res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
-      if (index + 1 < timeLocationArray.length) {
+      if (false) {
         res += `, `;
       }
killedBy: section utils tests formatLocation tests formatLocation test
statusReason: expected 'LOC1 1LOC2 2' to be 'LOC1 1, LOC2 2' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:15:11
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
       res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
-      if (index + 1 < timeLocationArray.length) {
+      if (index + 1 >= timeLocationArray.length) {
         res += `, `;
       }
killedBy: section utils tests formatLocation tests formatLocation test
statusReason: expected 'LOC1 1LOC2 2, ' to be 'LOC1 1, LOC2 2' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:26:50
 };
 
 // Takes a time location array and returns the days
-export const formatDays = (timeLocationArray) => {
-  try {
-    let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
-      res +=
-        timeLocationArray[index].days !== null
-          ? `${timeLocationArray[index].days}`
-          : "";
-      if (
-        index + 1 < timeLocationArray.length &&
-        timeLocationArray[index].days !== null
-      ) {
-        res += `, `;
-      }
-    }
-    return res;
-  } catch {
-    return "";
-  }
-};
+export const formatDays = (timeLocationArray) => {};
 
 // Takes a time location array and returns the time range
killedBy: section utils tests formatDays tests formatDays test 1
statusReason: expected undefined to be 'M W, R F' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:27:7
 
 // Takes a time location array and returns the days
 export const formatDays = (timeLocationArray) => {
-  try {
-    let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
-      res +=
-        timeLocationArray[index].days !== null
-          ? `${timeLocationArray[index].days}`
-          : "";
-      if (
-        index + 1 < timeLocationArray.length &&
-        timeLocationArray[index].days !== null
-      ) {
-        res += `, `;
-      }
-    }
-    return res;
-  } catch {
+  try {} catch {
     return "";
   }
killedBy: section utils tests formatDays tests formatDays test 1
statusReason: expected undefined to be 'M W, R F' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:29:68
 export const formatDays = (timeLocationArray) => {
   try {
     let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
-      res +=
-        timeLocationArray[index].days !== null
-          ? `${timeLocationArray[index].days}`
-          : "";
-      if (
-        index + 1 < timeLocationArray.length &&
-        timeLocationArray[index].days !== null
-      ) {
-        res += `, `;
-      }
-    }
+    for (let index = 0; index < timeLocationArray.length; index++) {}
     return res;
   } catch {
killedBy: section utils tests formatDays tests formatDays test 1
statusReason: expected '' to be 'M W, R F' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:31:9
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
       res +=
-        timeLocationArray[index].days !== null
+        true
           ? `${timeLocationArray[index].days}`
           : "";
killedBy: section utils tests formatDays tests formatDays test 2
statusReason: expected 'nullR F' to be 'R F' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:31:9
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
       res +=
-        timeLocationArray[index].days !== null
+        timeLocationArray[index].days === null
           ? `${timeLocationArray[index].days}`
           : "";
killedBy: section utils tests formatDays tests formatDays test 1
statusReason: expected ', ' to be 'M W, R F' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:35:9
           ? `${timeLocationArray[index].days}`
           : "";
       if (
-        index + 1 < timeLocationArray.length &&
+        index + 1 <= timeLocationArray.length &&
         timeLocationArray[index].days !== null
       ) {
killedBy: section utils tests formatDays tests formatDays test 1
statusReason: expected 'M W, R F, ' to be 'M W, R F' // Object.is equality

[Killed] LogicalOperator
src/main/utils/sectionUtils.jsx:35:9
           ? `${timeLocationArray[index].days}`
           : "";
       if (
-        index + 1 < timeLocationArray.length &&
-        timeLocationArray[index].days !== null
+        index + 1 < timeLocationArray.length || timeLocationArray[index].days !== null
       ) {
         res += `, `;
killedBy: section utils tests formatDays tests formatDays test 1
statusReason: expected 'M W, R F, ' to be 'M W, R F' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:36:9
           : "";
       if (
         index + 1 < timeLocationArray.length &&
-        timeLocationArray[index].days !== null
+        timeLocationArray[index].days === null
       ) {
         res += `, `;
killedBy: section utils tests formatDays tests formatDays test 1
statusReason: expected 'M WR F' to be 'M W, R F' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:48:50
 };
 
 // Takes a time location array and returns the time range
-export const formatTime = (timeLocationArray) => {
-  try {
-    let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
-      res += convertToTimeRange(
-        hhmmTohhmma(timeLocationArray[index].beginTime),
-        hhmmTohhmma(timeLocationArray[index].endTime),
-      );
-      if (index + 1 < timeLocationArray.length) {
-        res += `, `;
-      }
-    }
-    return res;
-  } catch {
-    return "";
-  }
-};
+export const formatTime = (timeLocationArray) => {};
 
 // Takes a instructors array and returns the instructors
killedBy: section utils tests formatTime tests formatTime test 3
statusReason: expected undefined to be '3:30 PM - 4:45 PM, 10:30 AM - 11:45 AM' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:49:7
 
 // Takes a time location array and returns the time range
 export const formatTime = (timeLocationArray) => {
-  try {
-    let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
-      res += convertToTimeRange(
-        hhmmTohhmma(timeLocationArray[index].beginTime),
-        hhmmTohhmma(timeLocationArray[index].endTime),
-      );
-      if (index + 1 < timeLocationArray.length) {
-        res += `, `;
-      }
-    }
-    return res;
-  } catch {
+  try {} catch {
     return "";
   }
killedBy: section utils tests formatTime tests formatTime test 3
statusReason: expected undefined to be '3:30 PM - 4:45 PM, 10:30 AM - 11:45 AM' // Object.is equality

[Killed] AssignmentOperator
src/main/utils/sectionUtils.jsx:52:7
   try {
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
-      res += convertToTimeRange(
-        hhmmTohhmma(timeLocationArray[index].beginTime),
-        hhmmTohhmma(timeLocationArray[index].endTime),
-      );
+      res -= convertToTimeRange(hhmmTohhmma(timeLocationArray[index].beginTime), hhmmTohhmma(timeLocationArray[index].endTime));
       if (index + 1 < timeLocationArray.length) {
         res += `, `;
killedBy: section utils tests formatTime tests formatTime test 3
statusReason: expected NaN to be '3:30 PM - 4:45 PM, 10:30 AM - 11:45 AM' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:56:11
         hhmmTohhmma(timeLocationArray[index].beginTime),
         hhmmTohhmma(timeLocationArray[index].endTime),
       );
-      if (index + 1 < timeLocationArray.length) {
+      if (false) {
         res += `, `;
       }
killedBy: section utils tests formatTime tests formatTime test 3
statusReason: expected '3:30 PM - 4:45 PM10:30 AM - 11:45 AM' to be '3:30 PM - 4:45 PM, 10:30 AM - 11:45 AM' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:56:49
         hhmmTohhmma(timeLocationArray[index].beginTime),
         hhmmTohhmma(timeLocationArray[index].endTime),
       );
-      if (index + 1 < timeLocationArray.length) {
-        res += `, `;
-      }
+      if (index + 1 < timeLocationArray.length) {}
     }
     return res;
killedBy: section utils tests formatTime tests formatTime test 3
statusReason: expected '3:30 PM - 4:45 PM10:30 AM - 11:45 AM' to be '3:30 PM - 4:45 PM, 10:30 AM - 11:45 AM' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:67:55
 };
 
 // Takes a instructors array and returns the instructors
-export const formatInstructors = (instructorArray) => {
-  try {
-    let res = "";
-    for (let index = 0; index < instructorArray.length; index++) {
-      res += `${instructorArray[index].instructor}`;
-      if (index + 1 < instructorArray.length) {
-        res += `, `;
-      }
-    }
-    return res;
-  } catch {
-    return "";
-  }
-};
+export const formatInstructors = (instructorArray) => {};
 
 export const isSection = (en1) => {
killedBy: section utils tests formatInstructors tests formatInstructors test
statusReason: expected undefined to be 'HESPANHA J P, JOHN S' // Object.is equality

[Killed] UpdateOperator
src/main/utils/sectionUtils.jsx:70:57
 export const formatInstructors = (instructorArray) => {
   try {
     let res = "";
-    for (let index = 0; index < instructorArray.length; index++) {
+    for (let index = 0; index < instructorArray.length; index--) {
       res += `${instructorArray[index].instructor}`;
       if (index + 1 < instructorArray.length) {
killedBy: section utils tests formatInstructors tests formatInstructors test
statusReason: expected '' to be 'HESPANHA J P, JOHN S' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:70:25
 export const formatInstructors = (instructorArray) => {
   try {
     let res = "";
-    for (let index = 0; index < instructorArray.length; index++) {
+    for (let index = 0; index <= instructorArray.length; index++) {
       res += `${instructorArray[index].instructor}`;
       if (index + 1 < instructorArray.length) {
killedBy: section utils tests formatInstructors tests formatInstructors test
statusReason: expected '' to be 'HESPANHA J P, JOHN S' // Object.is equality

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:71:14
   try {
     let res = "";
     for (let index = 0; index < instructorArray.length; index++) {
-      res += `${instructorArray[index].instructor}`;
+      res += ``;
       if (index + 1 < instructorArray.length) {
         res += `, `;
killedBy: section utils tests formatInstructors tests formatInstructors test
statusReason: expected ', ' to be 'HESPANHA J P, JOHN S' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:72:11
     let res = "";
     for (let index = 0; index < instructorArray.length; index++) {
       res += `${instructorArray[index].instructor}`;
-      if (index + 1 < instructorArray.length) {
+      if (index + 1 >= instructorArray.length) {
         res += `, `;
       }
killedBy: section utils tests formatInstructors tests formatInstructors test
statusReason: expected 'HESPANHA J PJOHN S, ' to be 'HESPANHA J P, JOHN S' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:72:11
     let res = "";
     for (let index = 0; index < instructorArray.length; index++) {
       res += `${instructorArray[index].instructor}`;
-      if (index + 1 < instructorArray.length) {
+      if (false) {
         res += `, `;
       }
killedBy: section utils tests formatInstructors tests formatInstructors test
statusReason: expected 'HESPANHA J PJOHN S' to be 'HESPANHA J P, JOHN S' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:83:10
 };
 
 export const isSection = (en1) => {
-  return en1.substring(2) !== "00";
+  return false;
 };
 
killedBy: section utils tests isSection tests isSection true test
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:83:10
 };
 
 export const isSection = (en1) => {
-  return en1.substring(2) !== "00";
+  return en1.substring(2) === "00";
 };
 
killedBy: section utils tests isSection tests isSection true test
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:88:32
 
 // returns the course status based on cancel, closed, or full
 export const formatStatus = (section) => {
-  if (section.courseCancelled) {
-    return "Cancelled";
-  } else if (section.classClosed === "Y") {
+  if (section.courseCancelled) {} else if (section.classClosed === "Y") {
     return "Closed";
   } else if (section.enrolledTotal >= section.maxEnroll) {
killedBy: section utils tests formatStatus tests formatStatus cancelled test
statusReason: expected undefined to be 'Cancelled' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:88:7
 
 // returns the course status based on cancel, closed, or full
 export const formatStatus = (section) => {
-  if (section.courseCancelled) {
+  if (true) {
     return "Cancelled";
   } else if (section.classClosed === "Y") {
killedBy: section utils tests formatStatus tests formatStatus closed test
statusReason: expected 'Cancelled' to be 'Closed' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:90:43
 export const formatStatus = (section) => {
   if (section.courseCancelled) {
     return "Cancelled";
-  } else if (section.classClosed === "Y") {
-    return "Closed";
-  } else if (section.enrolledTotal >= section.maxEnroll) {
+  } else if (section.classClosed === "Y") {} else if (section.enrolledTotal >= section.maxEnroll) {
     return "Full";
   } else {
killedBy: section utils tests formatStatus tests formatStatus closed test
statusReason: expected undefined to be 'Closed' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:90:14
 export const formatStatus = (section) => {
   if (section.courseCancelled) {
     return "Cancelled";
-  } else if (section.classClosed === "Y") {
+  } else if (true) {
     return "Closed";
   } else if (section.enrolledTotal >= section.maxEnroll) {
killedBy: section utils tests formatStatus tests formatStatus full test
statusReason: expected 'Closed' to be 'Full' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:92:14
     return "Cancelled";
   } else if (section.classClosed === "Y") {
     return "Closed";
-  } else if (section.enrolledTotal >= section.maxEnroll) {
+  } else if (section.enrolledTotal < section.maxEnroll) {
     return "Full";
   } else {
killedBy: section utils tests formatStatus tests formatStatus full test
statusReason: expected 'Open' to be 'Full' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:92:14
     return "Cancelled";
   } else if (section.classClosed === "Y") {
     return "Closed";
-  } else if (section.enrolledTotal >= section.maxEnroll) {
+  } else if (true) {
     return "Full";
   } else {
killedBy: section utils tests formatStatus tests formatStatus open test
statusReason: expected 'Full' to be 'Open' // Object.is equality

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:95:12
   } else if (section.enrolledTotal >= section.maxEnroll) {
     return "Full";
   } else {
-    return "Open";
+    return "";
   }
 };
killedBy: section utils tests formatStatus tests formatStatus open test
statusReason: expected '' to be 'Open' // Object.is equality

[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:99:27
   }
 };
 
-export const getQuarter = (row) =>
-  row.depth === 0 ? row.original.quarter : row.getParentRow().original.quarter;
+export const getQuarter = () => undefined;
 
 export const formatInfoLink = (row) =>
killedBy: section utils tests formatInfoLink tests formatInfoLink works on a primary
statusReason: expected '/coursedetails/undefined/30247' to be '/coursedetails/20244/30247' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:100:3
 };
 
 export const getQuarter = (row) =>
-  row.depth === 0 ? row.original.quarter : row.getParentRow().original.quarter;
+  row.depth !== 0 ? row.original.quarter : row.getParentRow().original.quarter;
 
 export const formatInfoLink = (row) =>
killedBy: section utils tests formatInfoLink tests formatInfoLink works on a primary
statusReason: row.getParentRow is not a function

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:100:3
 };
 
 export const getQuarter = (row) =>
-  row.depth === 0 ? row.original.quarter : row.getParentRow().original.quarter;
+  true ? row.original.quarter : row.getParentRow().original.quarter;
 
 export const formatInfoLink = (row) =>
killedBy: section utils tests formatInfoLink tests formatInfoLink works on another primary
statusReason: expected '/coursedetails/undefined/30254' to be '/coursedetails/20244/30254' // Object.is equality

[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:102:31
 export const getQuarter = (row) =>
   row.depth === 0 ? row.original.quarter : row.getParentRow().original.quarter;
 
-export const formatInfoLink = (row) =>
-  `/coursedetails/${getQuarter(row)}/${getSectionField(row, "enrollCode")}`;
+export const formatInfoLink = () => undefined;
 
 export const renderInfoLink = (row, testid) => (
killedBy: section utils tests formatInfoLink tests formatInfoLink works on a primary
statusReason: expected undefined to be '/coursedetails/20244/30247' // Object.is equality

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:103:3
   row.depth === 0 ? row.original.quarter : row.getParentRow().original.quarter;
 
 export const formatInfoLink = (row) =>
-  `/coursedetails/${getQuarter(row)}/${getSectionField(row, "enrollCode")}`;
+  ``;
 
 export const renderInfoLink = (row, testid) => (
killedBy: section utils tests formatInfoLink tests formatInfoLink works on a primary
statusReason: expected '' to be '/coursedetails/20244/30247' // Object.is equality

[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:105:31
 export const formatInfoLink = (row) =>
   `/coursedetails/${getQuarter(row)}/${getSectionField(row, "enrollCode")}`;
 
-export const renderInfoLink = (row, testid) => (
-  <p className="text-center">
-    <a
-      href={formatInfoLink(row)}
-      data-testid={`${testid}-row-${row.id}-col-info-link`}
-      target={"_blank"}
-      rel="noopener noreferrer"
-      style={{ color: "black", backgroundColor: "inherit" }}
-    >
-      <FontAwesomeIcon icon={faInfoCircle} />
-    </a>
-  </p>
-);
+export const renderInfoLink = () => undefined;
 
 export function enrollmentFraction(row) {
killedBy: section utils tests renderInfoLink tests renderInfoLink test
statusReason: Cannot read properties of undefined (reading 'props')

[Killed] ObjectLiteral
src/main/utils/sectionUtils.jsx:112:14
       data-testid={`${testid}-row-${row.id}-col-info-link`}
       target={"_blank"}
       rel="noopener noreferrer"
-      style={{ color: "black", backgroundColor: "inherit" }}
+      style={{}}
     >
       <FontAwesomeIcon icon={faInfoCircle} />
killedBy: section utils tests renderInfoLink tests renderInfoLink test
statusReason: expected undefined to be 'black' // Object.is equality

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:112:49
       data-testid={`${testid}-row-${row.id}-col-info-link`}
       target={"_blank"}
       rel="noopener noreferrer"
-      style={{ color: "black", backgroundColor: "inherit" }}
+      style={{ color: "black", backgroundColor: "" }}
     >
       <FontAwesomeIcon icon={faInfoCircle} />
killedBy: SectionsTable tests Section Table tests Info link is correct
statusReason: expect(element).toHaveAttribute("style", "color: black; background-color: inherit;") // element.getAttribute("style") === "color: black; background-color: inherit;"

Expected the element to have attribute:
  style="color: black; background-color: inherit;"
Received:
  style="color: black;"

[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:126:26
   return result;
 }
 
-export const isPrimary = (row) => "primary" in row.original;
+export const isPrimary = () => undefined;
 
 export const isLectureWithNoSections = (row) =>
killedBy: section utils tests tests that depend on what kind of row it is isLectureWithNoSections true test
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:129:21
 export const isPrimary = (row) => "primary" in row.original;
 
 export const isLectureWithNoSections = (row) =>
-  isPrimary(row) && row.original.subRows.length === 0;
+  isPrimary(row) && true;
 
 export const shouldShowAddToScheduleLink = (row) =>
killedBy: section utils tests tests that depend on what kind of row it is isLectureWithNoSections true test
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:131:44
 export const isLectureWithNoSections = (row) =>
   isPrimary(row) && row.original.subRows.length === 0;
 
-export const shouldShowAddToScheduleLink = (row) =>
-  !isPrimary(row) || row.original.subRows.length === 0;
+export const shouldShowAddToScheduleLink = () => undefined;
 
 export function getSection(row) {
killedBy: section utils tests tests that depend on what kind of row it is shouldShowAddToScheduleLink returns correct values
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:132:22
   isPrimary(row) && row.original.subRows.length === 0;
 
 export const shouldShowAddToScheduleLink = (row) =>
-  !isPrimary(row) || row.original.subRows.length === 0;
+  !isPrimary(row) || false;
 
 export function getSection(row) {
killedBy: section utils tests tests that depend on what kind of row it is shouldShowAddToScheduleLink returns correct values
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/main/utils/sectionUtils.jsx:132:3
   isPrimary(row) && row.original.subRows.length === 0;
 
 export const shouldShowAddToScheduleLink = (row) =>
-  !isPrimary(row) || row.original.subRows.length === 0;
+  !isPrimary(row) && row.original.subRows.length === 0;
 
 export function getSection(row) {
killedBy: section utils tests tests that depend on what kind of row it is shouldShowAddToScheduleLink returns correct values
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:134:33
 export const shouldShowAddToScheduleLink = (row) =>
   !isPrimary(row) || row.original.subRows.length === 0;
 
-export function getSection(row) {
-  return "primary" in row.original ? row.original.primary : row.original;
-}
+export function getSection(row) {}
 
 export function getSectionField(row, key) {
killedBy: section utils tests formatInfoLink tests formatInfoLink works on a primary
statusReason: Cannot read properties of undefined (reading 'enrollCode')

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:138:43
   return "primary" in row.original ? row.original.primary : row.original;
 }
 
-export function getSectionField(row, key) {
-  return getSection(row)[key];
-}
+export function getSectionField(row, key) {}
 
killedBy: section utils tests formatInfoLink tests formatInfoLink works on a primary
statusReason: expected '/coursedetails/20244/undefined' to be '/coursedetails/20244/30247' // Object.is equality
