[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:57:5
     localEndQuarter || quarters[0].yyyyq,
   );
   const [subject, setSubject] = useState(
-    localSubject || subjects[0]?.subjectCode || defaultSubjectArea,
+    localSubject && subjects[0]?.subjectCode || defaultSubjectArea,
   );
   const [courseNumber, setCourseNumber] = useState("");
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly with mocked localStorage values
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^CMPSC$/
Received:
  ANTH

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:129:18
                 })}
               />
               <Form.Text muted>
-                {"For example: '16' or '130A'; omit the subject area prefix."}
+                {""}
               </Form.Text>
               <Form.Control.Feedback type="invalid">
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: Unable to find an element with the text: /for example: '16' or '130a'; omit the subject area prefix./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="CourseOverTimeSearchForm"

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:150:29
             <p data-testid="CourseOverTimeSearchForm.FullSearchString">
               Searching for:&nbsp;
               <code data-testid="CourseOverTimeSearchForm.SearchString">{`${subject} ${courseNumber}${courseSuf}`}</code>
-              for quarters {`${yyyyqToQyy(startQuarter)}`} through&nbsp;
+              for quarters {``} through&nbsp;
               {`${yyyyqToQyy(endQuarter)}`}
             </p>
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^Searching for: ANTH for quarters W22 through W22$/
Received:
  Searching for: ANTH for quarters through W22
